# Brewfile
# Some large apps such as Final Cut Pro X is omitted.

tap "homebrew/bundle"
tap "homebrew/cask-versions"

# Personal
brew "mas"

cask "1password"
# cask "aerial"
cask "arc"
# cask "betterdisplay"
cask "bettertouchtool"
cask "chatgpt"
# cask "cheatsheet"
cask "discord"
cask "jordanbaird-ice"
# cask "kawa"
cask "linear-linear"
cask "minecraft"
# cask "hazeover"
cask "monitorcontrol"
cask "notion-calendar"
cask "opal-app"
cask "raycast"
cask "steam"
cask "tailscale-app"
cask "thingsmacsandboxhelper"
cask "timemachineeditor"
cask "typora"

# mas "Amphetamine", id: 937984704
# mas "Fantastical", id: 975937182
# mas "isHUD", id: 484757536
mas "KakaoTalk", id: 869223134
mas "Slack", id: 803453959
# mas "Speedtest", id: 1153157709
# mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696

# Development
# tap "homebrew/command-not-found"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "oven-sh/bun"

# brew "act"
brew "asciinema"
brew "awscli"
brew "bat"
brew "cocoapods"
brew "csvlens"
brew "git-delta"
brew "direnv"
brew "eza"
brew "f2"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gpg"
brew "hashicorp/tap/terraform"
brew "htmlq"
brew "htop"
brew "hyperfine"
brew "ios-deploy"
brew "jc"
brew "jj"
brew "jump"
brew "jq"
brew "mise"
brew "nvm"
brew "nvtop"
brew "oven-sh/bun/bun"
brew "openjdk"
brew "openjdk@17"
brew "openssl"
brew "peco"
brew "pipet"
brew "pre-commit"
brew "pstree"
brew "sq"
brew "uv"
brew "rclone"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "starship"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "tig"
brew "tmux"
brew "watchman"
brew "wget"
brew "vim"
brew "zsh"
brew "zig"

cask "aldente"
cask "claude-code"
cask "codex"
cask "ghostty"
cask "github"
cask "gcloud-cli"
cask "google-chrome"
cask "gpg-suite"
cask "jetbrains-toolbox"
cask "netron"
cask "orbstack"
cask "postman"
cask "sf-symbols"
cask "tuist"
cask "unity-hub"
cask "visual-studio-code"

# Fonts
tap "homebrew/cask-fonts"
cask "font-d2coding"
cask "font-monoid"
cask "font-gugi"
cask "font-linux-libertine"
cask "font-new-york"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-pretendard"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-meslo-lg-nerd-font"
