# Brewfile
# Some large apps such as Final Cut Pro X is omitted.

tap "homebrew/bundle"
tap "homebrew/cask-versions"

# Personal
brew "mas"

# cask "aerial"
cask "arc"
cask "betterdisplay"
cask "bettertouchtool"
cask "chatgpt"
# cask "cheatsheet"
cask "discord"
cask "jordanbaird-ice"
cask "kawa"
cask "linear-linear"
cask "minecraft"
# cask "hazeover"
cask "mendeley"
cask "monitorcontrol"
cask "movist-pro"
cask "notion-calendar"
cask "raycast"
cask "steam"
cask "thingsmacsandboxhelper"
cask "timemachineeditor"
cask "typora"

mas "Amphetamine", id: 937984704
# mas "Fantastical", id: 975937182
# mas "isHUD", id: 484757536
mas "KakaoTalk", id: 869223134
mas "Slack", id: 803453959
# mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696

# Development
# tap "homebrew/command-not-found"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "oven-sh/bun"

brew "act"
brew "asciinema"
brew "awscli"
brew "bat"
brew "cocoapods"
brew "corepack" # for yarn
brew "csvlens"
brew "direnv"
brew "dvc"
brew "eza"
brew "fastlane"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gpg"
brew "hatch"
brew "htop"
brew "ios-deploy"
brew "jump"
brew "jq"
brew "mysql-client@8.0"
brew "node"
brew "node@20"
brew "nvm"
brew "nvtop"
brew "oven-sh/bun/bun"
brew "openfortivpn"
brew "openjdk"
brew "openssl"
brew "peco"
brew "pre-commit"
brew "pstree"
brew "pyenv-virtualenv"
brew "python"
brew "python@3.7"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "ruff"
# brew "rust" # use rustup instead of homebrew formula
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "hashicorp/tap/terraform"
brew "thefuck"
brew "tig"
brew "tmux"
brew "watchman"
brew "vim"
brew "zsh"

# cask "aldente"
cask "android-studio"
cask "cursor"
cask "docker"
cask "github"
# cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "insomnia"
# cask "jetbrains-toolbox"
cask "netron"
cask "notion"
cask "sf-symbols"
cask "tuist"
cask "visual-studio-code"
cask "warp"
cask "wineskin"

# Fonts
tap "homebrew/cask-fonts"
cask "font-monoid"
cask "font-gugi"
cask "font-linux-libertine"
cask "font-new-york"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-pretendard"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
