# Brewfile
# Some large apps such as Final Cut Pro X is omitted.

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Personal
brew "mas"

cask "aerial" # Screen Saver.
cask "alfred"
# cask "airfoil"
# cask "airserver"
cask "bartender"
cask "bettertouchtool"
cask "cheatsheet"
cask "hazeover"
cask "movist-pro"
cask "steam"
cask "typora"
# cask "rectangle"
cask "rocket"
# cask "virtualbox"
# cask "vlc"
cask "quitter"

mas "Amphetamine", id: 937984704
mas "Between", id: 1320741520
mas "Fantastical", id: 975937182
mas "isHUD", id: 484757536
mas "KakaoTalk", id: 869223134
mas "Microsoft To Do", id: 1274495053
mas "Monit", id: 1014850245
mas "Paste - Clipboard Manager", id: 967805235
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353

# Development
brew "cocoapods"
brew "git"
brew "go"
brew "openssl"
brew "peco"
brew "python"
brew "zsh"

cask "atom"
cask "couleurs"
cask "dash"
cask "docker"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "sequel-pro"

mas "LittleIpsum", id: 405772121
mas "2Icon", id: 1049625579

# Fonts
tap "homebrew/cask-fonts"
cask "font-monoid"
cask "font-fira-code"
cask "font-noto-sans"
cask "font-noto-sans-cjk"

tap "gerrit/homebrew-fonts-sanfrancisco"
cask "font-sanfrancisco"
